Revit 2027 API
ExportLayerInfo.RemoveCutLayerModifier Method
 Removes a cut layer modifier from the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveCutLayerModifier(
	LayerModifier layerModifier
)
Public Sub RemoveCutLayerModifier (
	layerModifier As LayerModifier
)
public:
void RemoveCutLayerModifier(
	LayerModifier^ layerModifier
)
member RemoveCutLayerModifier :
        layerModifier : LayerModifier -> unit
Parameters
layerModifier LayerModifier
 The cut layer modifier.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace